###############################################################################
# Homebrew
###############################################################################

"homebrew/bundle"
"homebrew/cask"
"homebrew/core"
"homebrew/services"

###############################################################################
# CLI
###############################################################################

brew "git"
brew "gh"
brew "git-lfs"
brew "wget"
brew "curl"
brew "mise"
brew "uv"
brew "tree"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "gnu-sed"
brew "coreutils"
brew "openssl"
brew "gnupg"
brew "watch"
brew "htop"
brew "tmux"
brew "zoxide"
brew "direnv"
brew "mas"

###############################################################################
# Fonts
###############################################################################

cask "font-hack-nerd-font"

###############################################################################
# Browser
###############################################################################

cask "google-chrome"

cask "firefox"

cask "arc"

###############################################################################
# Utilities
###############################################################################

cask "devtoys"
cask "appcleaner"
cask "aldente"
cask "keka"
cask "google-japanese-ime"

###############################################################################
# Finder
###############################################################################

cask "forklift"

###############################################################################