###############################################################################
# AI
###############################################################################

brew "ollama"

brew "ffmpeg"

brew "sox"

brew "imagemagick"

brew "protobuf"

brew "graphviz"

brew "sqlite"

brew "duckdb"

brew "pandoc"

brew "tesseract"

brew "poppler"

brew "libomp"

brew "huggingface-cli"

###############################################################################
# AI
###############################################################################

cask "chatgpt"

cask "chatgpt-atlas"

cask "claude"

cask "open-webui"

###############################################################################
# AI Utilities
###############################################################################

brew "huggingface-cli"

###############################################################################